from interfaces import console
from tools import simple, info

simple.pos_switch(info.ac_path())
console.run()

r''' Задачи на выполнение:
1) Поменять возвращаемые значения в sub на ошибки
2) Перенести mods из console в core
3) Позволить пользователю отключать extens, mods и ограничивать tools для полной кастомизации своего окружения
4) Реализовать, что бы ошибка уходила в конкретную строчку коннкретного файла extens

-) Поправить переборгу аргументов (не всегда аргументы могут быть преобразованны по причине допущеной ошибки в extens)
-) Доработать инструмент для получения аргументов
-) Сделать поддержку аргументов и конструкций через пробелы в ядре
1) Добавить и доработать работу с глобальными переменными
2) Реализовать работу с наименованиями всех потоков и их позиций
3) Добавить поддержку непостоянных аргументов в командах ядра
4) Реализовать установку требуемых пакетов, но сделать так, что бы после установки запуск был быстрее
5) Переработать класс hts
6) Сделать проект настраивамым через hts
?) Импортировать всё из предыдущих версий АС и доработать под новую версию
?) Реализовать локализацию
?) Создать менеджер потоков, позволяющий запускать потоки при помощи команд и их закрытие
?) Сделать запуск АС "другим окном", что бы не перекрывать уже введёные пользователем команды
'''

r''' Выполненые:
Воспользоваться os.chdir(sys.path[0]), для правильной работы open()
Создать класс Exception для возвращения его из ядра при возникновении ошибки. Данный класс должен содержать документацию, атрибуты, аргументы, и содержание ошибки (Выполнен необходимый минимум)
Проверить возможность создания нескольки имён в потоках (Такая возможность есть)
Попытаться создать виртуальный текстовый документ, для получения текста ошибки из потока (Возможно есть способ. Но я просто создам временный файл в дате, не думаю что это станет проблемой)
Проверить, вылетает ли основное приложение, при вызове ошибки в потоке (не вылетает)
Только начал записывать сделанную работу. Написал самую основную жилку, теперь буду восстанавливать все предыдущие версии
'''